InformationRegisters/НомераДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>НомераДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НомераДокументов/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

//+++АК LATV 2018.10.18 ИП-00020107
Функция ПолучитьИЗафиксироватьНовыйИдентификатор(ВидИдентификатора, Отказ = Ложь) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.НомераДокументов");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Вид", ВидИдентификатора);
	
	НачатьТранзакцию();
	
	Попытка
		Блокировка.Заблокировать();
		
		Запись = РегистрыСведений.НомераДокументов.СоздатьМенеджерЗаписи();
		Запись.Вид = ВидИдентификатора;
		Запись.Прочитать();
		
		Запись.Номер = Запись.Номер + 1;
		Запись.Записать();
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось получить новый номер для вида идентификатора ""%1"" по причине: %2'")
			, ВидИдентификатора, ОписаниеОшибки());
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат Запись.Номер;

КонецФункции

#КонецОбласти
